{
  "blurb": [
    "I have been fascinated with computers since my childhood and that passion has taken me through a bachelor's degree, a PhD and into a career in industry.",
    "I aim to use the holistic perspective and skills I have gained to work with cutting-edge technologies on new frontiers where I can contribute to making the world a simpler, more fun, and hopefully a little better place.",
    "For the last two years I have been working in a functional programming style and with functional stacks (mainly in Scala) and I am looking for opportunities to further my functional programming abilities."
  ],

  "experience": {
    "title": "Experience",
    "items": [
      {
        "dateSpan": "May 2017 - Now:",
        "title": "Senior Software Engineer @ Premonition",
        "description": {
          "title": "Since joining Premonition I've worked on three products, all in Scala, and all using core Scala libraries such as Scalaz, Http4s, Doobie and Argonaut. This includes developing a new back-end from scratch to support a new product, including a full suite of tests mocking a set of remote services."
        }
      },
      {
        "dateSpan": "March 2016 – May 2017:",
        "title": "Senior Software Engineer (Big data) @ CBA",
        "description": {
          "title": "During my time at CBA I worked on an internal product used to coordinate and transfer large volumes of data from a Hadoop-based big data cluster to internal consumers as part of the bank's ETL pipeline. It was written largely in Scala and built on Cascading / Scalding.\nI also worked on a web-based DevOps tool developed to configure the application described earlier. It was written with a Scala backend (using Akka-Http) and a JavaScript frontend (using Angular)."
        }
      },

      {
        "title": "Software Developer @ Covata Australia",
        "dateSpan": "October 2014 - Now",
        "description": {
          "description": {
            "styles": [],
            "elems": [
              {
                "styles": [],
                "text": "Employed as a full-stack software developer, responsible for developing a security application using a Java + Scala + Angular + Spring stack in an Agile team. In addition to software development skills, the role also requires aspects of a Business Analyst, with all team members expected to contribute to the ongoing design and improvement of the product.\nSome highlights:"
              },
              {
                "styles": [],
                "items": [
                  {
                    "styles": [],
                    "text": "Won our spike day for the development of an approach to non-destructively reorganizing data through alternate storage (currently serialization, but optimally use of a NoSQL database) of database views."
                  },
                  {
                    "styles": [],
                    "text": "Led the development of our (multi-client RESTful web-API) product's internationalization framework."
                  }
                ]
              }
            ]
          }
        }
      },

      {
        "title": "Graduate Software Developer @ ThoughtWorks Australia",
        "dateSpan": "October 2013 - October 2014",
        "description": {
          "title": "Employed as part of ThoughtWorks professional services (consulting services) as a software developer. During my year at ThoughtWorks I worked with several clients:",
          "items": [
              {
                "title": "Software Developer @ a Major Australian bank",
                "description": "Employed to perform ongoing improvement of an online insurance sales platform. The platform backend is Spring-based and it employs a single-page client-side MVC front-end built on Angular."
              },
              {
                "title": "DevOps @ a Major Australian bank",
                "description": "Employed to transiton the client from a privately-hosted cloud located in a traditional data center to a cloud hosted using Amazon Web Services (AWS). Ansible was utilized to automatically deploy web applications to AWS and to provision the necessary infrastructure."
              },
              {
                "title": "Software Developer @ a Non-profit organization",
                "description": "Employed to develop an online questionnaire web application for mobile devices. The web application was built on the Javascript node.js framework backed by a MySQL database."
              },
              {
                "title": "Continuous Integration consultant @ a Large beverage distributor",
                "description": "Employed to introduce Agile quality assurance practices, including an automated testing framework and continuous integration (CI) facilitated by CI pipeline software. Responsibilities included setting up the framework and required technologies as well as supporting the local development team in adopting Agile development practices."
              }
          ]
        }
      }
    ]
  },

  "education": {
    "title": "Education",
    "items": [
      {
        "title": "Doctor of Computer Science @ Macquarie University, Australia",
        "dataSpan": "2008-2013:",
        "description": {
          "title": "The doctoral project, conducted with a MQRES (The Macquarie University Research Excellence Scholarships) involved the analysis of version repositories produced by students during their work on Computer Graphics assignment projects in order to identify student problems and issues with Computer Graphics programming. The analysis involved the development of a software tool for the analysis of version histories (called SCORE) as well as the development of software engineering methods for the machine-analysis of version histories.\n    During this time I was also involved in leading practical and tutorial sessions, as well as lecturing as a casual lecturer."
        }
      },
      {
        "dataSpan": "2005-2007:",
        "title": "Bachelor of Computer Science with Honors (First Class) @ Macquarie University, Australia",
        "description": {
          "title": "The honors project involved the development of a tool for the placement of objects in a room (developed with OpenGL). This tool was utilized to explore the nature of human memory through a controlled experiment in which participants were asked to reconstruct the room from memory and the order of their placement actions was recorded."
        }
      },
      {
        "dateSpan": "2001-2005:",
        "title": "Bachelor of Computer Science (GPA 3.743 of 4.0) @ Macquarie University, Australia",
        "description": {
          "title": "Completed my bachelor's degree at Macquarie University. I received letters of commendation for several of the courses I undertook and was involved with several societies such as the Buddhist Society, the Atheist Society, the MU Amnesty branch and Students for Peace and Justice."
        }
      }
    ]
  },

  "skills": {
    "title": "Skills",
    "items": [
      {
        "title": "Programming Languages",
        "description": {
          "description": {
            "styles": ["mainSectionDescription"],
            "elems": [
              {
                "styles": ["mainSubSectionItem"],
                "elems": [
                  {
                    "styles": ["sectionTitle"],
                    "text": "Expert (2+ years full-time experience):"
                  },
                  {
                    "styles": ["skillsPanel"],
                    "items": [
                      {
                        "styles": ["skill"],
                        "text": "Java"
                      },
                      {
                        "styles": ["skill"],
                        "text": "Scala"
                      }
                    ]
                  }
                ]
              },
              {
                "styles": ["mainSubSectionItem"],
                "elems": [
                  {
                    "styles": ["sectionTitle"],
                    "text": "Proficient (1+ year full-time experience):"
                  },
                  {
                    "styles": ["skillsPanel"],
                    "items": [
                      {
                        "styles": ["skill"],
                        "text": "Python"
                      },
                      {
                        "styles": ["skill"],
                        "text": "Javascript"
                      },
                      {
                        "styles": ["skill"],
                        "text": "Html/CSS/Sass"
                      },
                      {
                        "styles": ["skill"],
                        "text": "SQL"
                      }
                    ]
                  }
                ]
              },
              {
                "styles": ["mainSubSectionItem"],
                "elems": [
                  {
                    "styles": ["sectionTitle"],
                    "text": "Some exposure (I've worked with this before):"
                  },
                  {
                    "styles": ["skillsPanel"],
                    "items": [
                      {
                        "styles": ["skill"],
                        "text": "C/C++"
                      },
                      {
                        "styles": ["skill"],
                        "text": "Clojure"
                      },
                      {
                        "styles": ["skill"],
                        "text": "Haskell"
                      }
                    ]
                  }
                ]
              }
            ]
          }
        }
      },
      {
        "title": "Programming Languages",
        "description": {
          "description": {
            "styles": [
              "mainSectionDescription"
            ],
            "elems": [
              {
                "styles": [
                  "mainSubSectionItem"
                ],
                "elems": [
                  {
                    "styles": [
                      "sectionTitle"
                    ],
                    "text": "Expert (2+ years full-time experience):"
                  },
                  {
                    "styles": [
                      "skillsPanel"
                    ],
                    "items": [
                      {
                        "styles": [
                          "skill"
                        ],
                        "text": "Git"
                      }
                    ]
                  }
                ]
              },
              {
                "styles": [
                  "mainSubSectionItem"
                ],
                "elems": [
                  {
                    "styles": [
                      "sectionTitle"
                    ],
                    "text": "Proficient (1+ year full-time experience):"
                  },
                  {
                    "styles": [
                      "skillsPanel"
                    ],
                    "items": [
                      {
                        "styles": [
                          "skill"
                        ],
                        "text": "Cascading/Scalding"
                      },
                      {
                        "styles": [
                          "skill"
                        ],
                        "text": "AWS"
                      },
                      {
                        "styles": [
                          "skill"
                        ],
                        "text": "Http4s"
                      },
                      {
                        "styles": [
                          "skill"
                        ],
                        "text": "Play Framework"
                      },
                      {
                        "styles": [
                          "skill"
                        ],
                        "text": "Spring"
                      },
                      {
                        "styles": [
                          "skill"
                        ],
                        "text": "Angular"
                      }
                    ]
                  }
                ]
              },
              {
                "styles": [
                  "mainSubSectionItem"
                ],
                "elems": [
                  {
                    "styles": [
                      "sectionTitle"
                    ],
                    "text": "Some exposure (I've worked with this before):"
                  },
                  {
                    "styles": [
                      "skillsPanel"
                    ],
                    "items": [
                      {
                        "styles": [
                          "skill"
                        ],
                        "text": "Spark"
                      },
                      {
                        "styles": [
                          "skill"
                        ],
                        "text": "Akka"
                      },
                      {
                        "styles": [
                          "skill"
                        ],
                        "text": "Ansible"
                      }
                    ]
                  }
                ]
              }
            ]
          }
        }
      }
    ]
  }
}
